IDENTIFICATION DIVISION.  
    PROGRAM-ID. ADDER.
    AUTHOR. ALEX PIMENTA.
 
DATA DIVISION.  
    WORKING-STORAGE SECTION.  
    01 NUMBER1 PIC 9(3).  
    01 NUMBER2 PIC 9(3).  
    01 RESULT PIC 9(4).  
 
PROCEDURE DIVISION.  
    SET 4 TO NUMBER1.  
    SET 6 TO NUMBER2.  
 
    COMPUTE RESULT = NUMBER1 + NUMBER2.  
 
    DISPLAY 'The SUM ' NUMBER1 ' + ' NUMBER2.  
    DISPLAY 'IS EQUAL TO ' RESULT.  
    STOP RUN.
